openFoam/onrCht/combustorColdFlow/refined/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
		type			zeroGradient;
    }
    outlet
    {
		type			zeroGradient;
    }
    topWall
    {
        type            nutkWallFunction;
		value			uniform 0.0;
    }
    bottomWallInlet
    {
        type            nutkWallFunction;
		value			uniform 0.0;
    }
	bottomWall
	{
        type            nutkWallFunction;
		value			uniform 0.0;
	}
    frontAndBackWalls
    {
        type            nutkWallFunction;
		value			uniform 0.0;
	}
	stepHeight
    {
        type            nutkWallFunction;
		value			uniform 0.0;
    }
}

// ************************************************************************* //
